'''
使用while嵌套，完成以下图形的输出

```
    *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *
```
'''

#先打印没有空格的
#每行打印行数的星号
#行数
i = 1

while i < 10:
#打印个数
    if i <= 5:
        j = 1  #计数星号
        k = 1  #计数空格
        while k <= 5 - i:  #到中心位置的数量减去星星数
            print(' ', end='')
            k += 1
        while j <= (2 * i - 1):  #每行有(2n - 1)个星星
            print("*", end='')
            j += 1
    else:
        j = 1
        k = 1
        while k <= i - 5:
            print(' ', end='')
            k += 1
        while j <= (2 * (10 - i) - 1):
            print("*", end='')
            j += 1
    print()
    i += 1
