#征税，3500起征
'''
 应纳税所得额(含税)                        税率(%)
 不超过1500元的                              3
 超过1500元至4,500元的部分                   10
 超过4,500元至9,000元的部分                  20
 超过9,000元至35,000元的部分                 25
 超过35,000元至55,000元的部分                30
 超过55,000元至80,000元的部分                35
 超过80,000元的部分                          45
'''

#获得个人所得
money = float(input("请输入个人所得："))

#判断是否要交税
if money <= 3500:
    print("不用交税")
else:
    left = money - 3500
    if left <= 1500:
        tax = left * 0.03
        print("需要交 %d 元税。" % tax)
    elif 1500 < left <= 4500:
        tax = 1500 * 0.03 + (left - 1500) * 0.1
        print("需要交 %d 元税。" % tax)
    elif 4500 < left <= 9000:
        tax = 1500 * 0.03 + 3000 * 0.1 + (left - 4500) * 0.2
        print("需要交 %d 元税。" % tax)
    elif 9000 < left <= 35000:
        tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + (left - 9000) * 0.25
        print("需要交 %d 元税。" % tax)
    elif 35000 < left <= 55000:
        tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25 + (left - 35000) * 0.3
        print("需要交 %d 元税。" % tax)
    elif 55000 < left <= 80000:
        tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25 + 20000 * 0.3+ (left - 55000) * 0.35
        print("需要交 %d 元税。" % tax)
    else:
        tax = 1500 * 0.03 + 3000 * 0.1 + 4500 * 0.2 + 26000 * 0.25 + 20000 * 0.3 + 25000 * 0.35 +(left - 80000) * 0.45
        print("需要交 %d 元税。" % tax)